# CannotChangeInstFam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures..::..CannotChangeInstFam Property
BuiltInFailures..::..FamilyFailures Class See Also
---
Can't change Instance's Family. Try changing Instance's Host to a Level first.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotChangeInstFam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotChangeInstFam As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotChangeInstFam {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FamilyFailures Class
Autodesk.Revit.DB Namespace